# GetMullionIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CurtainGrid..::..GetMullionIds Method
CurtainGrid Class See Also
---
Gets all ElementIds of the mullions of the curtain grid.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public ICollection<ElementId> GetMullionIds()
```

Visual Basic
---
```text
Public Function GetMullionIds As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetMullionIds()
```

# ### Return Value
The mullion ElementIds
# Remarks
ElementIds are of Mullion Elements.
# See Also
CurtainGrid Class
Autodesk.Revit.DB Namespace